Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionRadial.GetDimensionSet Method
Overload List
Name | Description
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Inherited from CurvedDimensionBase.)
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Top
See Also
Reference
CurvedDimensionRadial Class
Tekla.Structures.Drawing Namespace